iot-chalmers/BlueFlood/platform/stm32nucleo-spirit1/stm32cube-lib/drivers/spirit1/inc/SPIRIT_Regs.h
/** @defgroup PCKT_FLT_GOALS_CONTROLx_FIELD_Registers
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_CONTROLx_FIELD  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    CONTROLx_FIELD[7:0]:   Control field (byte x) to be used as reference
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_CONTROL0_FIELD_BASE			((uint8_t)0x46) /*!< Control field (byte #3) */

#define	PCKT_FLT_GOALS_CONTROL1_FIELD_BASE			((uint8_t)0x47) /*!< Control field (byte #2) */

#define	PCKT_FLT_GOALS_CONTROL2_FIELD_BASE			((uint8_t)0x48) /*!< Control field (byte #1) */

#define	PCKT_FLT_GOALS_CONTROL3_FIELD_BASE			((uint8_t)0x49) /*!< Control field (byte #0) */

/**
 * @}
 */

/** @defgroup PCKT_FLT_GOALS_SOURCE_MASK_Register
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_SOURCE_MASK  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    RX_SOURCE_MASK[7:0]:   For received packet only: all 0s - no filtering
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_SOURCE_MASK_BASE				((uint8_t)0x4A) /*!< Source address mask, valid in RX mode */

/**
 * @}
 */

/** @defgroup PCKT_FLT_GOALS_SOURCE_ADDR_Register
 * @{
 */
/**
 *  \brief PCKT_FLT_GOALS_SOURCE_ADDR  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    RX_SOURCE_ADDR[7:0]:  RX packet source / TX packet destination fields
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_SOURCE_ADDR_BASE				((uint8_t)0x4B) /*!< Source address */

/**
 * @}
 */

/** @defgroup PCKT_FLT_GOALS_BROADCAST_Register
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_BROADCAST  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    BROADCAST[7:0]:  Address shared for broadcast communication link
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_BROADCAST_BASE				((uint8_t)0x4C) /*!< Address shared for broadcast communication links */

/**
 * @}
 */

/** @defgroup PCKT_FLT_GOALS_MULTICAST_Register
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_MULTICAST  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    MULTICAST[7:0]:  Address shared for multicast communication links
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_MULTICAST_BASE				((uint8_t)0x4D) /*!< Address shared for multicast communication links */

/**
 * @}
 */

/** @defgroup PCKT_FLT_GOALS_TX_SOURCE_ADDR_Register
 * @{
 */

/**
 *  \brief PCKT_FLT_GOALS_TX_SOURCE_ADDR  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0    TX_SOURCE_ADDR[7:0]:  TX packet source / RX packet destination fields
 *
 *   \endcode
 */
#define	PCKT_FLT_GOALS_TX_ADDR_BASE				((uint8_t)0x4E) /*!< Address of the destination (also device own address) */

/**
 * @}
 */

/** @defgroup PCKT_FLT_OPTIONS_Register
 * @{
 */

/**
 *  \brief PCKT_FLT_OPTIONS  register
 *  \code
 *   Default value: 0x70
 *   Read Write
 *   7   Reserved.
 *
 *   6   RX_TIMEOUT_AND_OR_SELECT[0]:  1 - ‘OR’ logical function applied to CS/SQI/PQI
 *                                     values (masked by 7:5 bits in PROTOCOL register)
 *   5   CONTROL_FILTERING[0]:         1 - RX packet accepted if its control fields matches
 *                                     with masked CONTROLx_FIELD registers.
 *   4   SOURCE_FILTERING[0]:          1 - RX packet accepted if its source field
 *                                     matches w/ masked RX_SOURCE_ADDR register.
 *   3   DEST_VS_ SOURCE _ADDR[0]:   1 - RX packet accepted if its destination
 *                                   address matches with TX_SOURCE_ADDR reg.
 *   2   DEST_VS_MULTICAST_ADDR[0]:  1 - RX packet accepted if its destination
 *                                   address matches with MULTICAST register
 *   1   DEST_VS_BROADCAST_ADDR[0]:  1 - RX packet accepted if its destination
 *                                   address matches with BROADCAST register.
 *   0   CRC_CHECK[0]:               1 - packet discarded if CRC not valid.
 *
 *   \endcode
 */
#define	PCKT_FLT_OPTIONS_BASE					((uint8_t)0x4F) /*!< Options relative to packet filtering */

#define	PCKT_FLT_OPTIONS_CRC_CHECK_MASK 			((uint8_t)0x01) /*!< Enable/disable of CRC check: packet is discarded if CRC is not valid [RX] */
#define	PCKT_FLT_OPTIONS_DEST_VS_BROADCAST_ADDR_MASK		((uint8_t)0x02) /*!< Packet discarded if destination address differs from BROADCAST register [RX] */
#define	PCKT_FLT_OPTIONS_DEST_VS_MULTICAST_ADDR_MASK		((uint8_t)0x04) /*!< Packet discarded if destination address differs from MULTICAST register [RX] */
#define	PCKT_FLT_OPTIONS_DEST_VS_TX_ADDR_MASK			((uint8_t)0x08) /*!< Packet discarded if destination address differs from TX_ADDR register [RX] */
#define	PCKT_FLT_OPTIONS_SOURCE_FILTERING_MASK		        ((uint8_t)0x10) /*!< Packet discarded if source address (masked by the SOURCE_MASK register)
                                                                                     differs from SOURCE_ADDR register [RX] */
#define	PCKT_FLT_OPTIONS_CONTROL_FILTERING_MASK		        ((uint8_t)0x20) /*!< Packet discarded if the x-byte (x=1¸4) control field  (masked by the CONTROLx_MASK register)
                                                                                     differs from CONTROLx_FIELD register [RX] */
#define	PCKT_FLT_OPTIONS_RX_TIMEOUT_AND_OR_SELECT		((uint8_t)0x40) /*!< Logical function applied to CS/SQI/PQI values (masked by [7:5] bits in PROTOCOL[2]
                                                                                     register) */

/**
 * @}
 */

/** @defgroup TX_CTRL_FIELD_Registers
 * @{
 */

/**
 *  \brief TX_CTRL_FIELDx  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0     TX_CTRLx[7:0]: Control field value to be used in TX packet as byte n.x
 *   \endcode
 */
#define	TX_CTRL_FIELD3_BASE					((uint8_t)0x68) /*!< Control field value to be used in TX packet as byte n.3 */

#define	TX_CTRL_FIELD2_BASE					((uint8_t)0x69) /*!< Control field value to be used in TX packet as byte n.2 */

#define	TX_CTRL_FIELD1_BASE					((uint8_t)0x6A) /*!< Control field value to be used in TX packet as byte n.1 */

#define	TX_CTRL_FIELD0_BASE					((uint8_t)0x6B) /*!< Control field value to be used in TX packet as byte n.0 */

/**
 * @}
 */


/** @defgroup TX_PCKT_INFO_Register
 * @{
 */

/**
 *  \brief TX_PCKT_INFO  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:6     Not used.
 *
 *   5:4     TX_SEQ_NUM:   Current TX packet sequence number
 *
 *   0       N_RETX[3:0]:  Number of retransmissions done on the
 *                        last TX packet
 *   \endcode
 */
#define	TX_PCKT_INFO_BASE					((uint8_t)(0xC2)) /*!< Current TX packet sequence number [5:4];
                                                                                        Number of retransmissions done on the last TX packet [3:0]*/
/**
 * @}
 */

/** @defgroup RX_PCKT_INFO_Register
 * @{
 */

/**
 *  \brief RX_PCKT_INFO  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:3     Not used.
 *
 *   2       NACK_RX:   NACK field of the received packet
 *
 *   1:0     RX_SEQ_NUM[1:0]:  Sequence number of the received packet
 *   \endcode
 */
#define	RX_PCKT_INFO_BASE					((uint8_t)(0xC3)) /*!< NO_ACK field of the received packet [2];
                                                                                       sequence number of the received packet [1:0]*/

#define	TX_PCKT_INFO_NACK_RX					((uint8_t)(0x04)) /*!< NACK field of the received packet */

/**
 * @}
 */

/** @defgroup RX_PCKT_LEN1
 * @{
 */

/**
 *  \brief RX_PCKT_LEN1  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   RX_PCKT_LEN1[7:0]:  Length (number of bytes) of the received packet: RX_PCKT_LEN=RX_PCKT_LEN1 × 256 + RX_PCKT_LEN0
 *                             This value is packet_length/256
 *   \endcode
 */
#define	RX_PCKT_LEN1_BASE					((uint8_t)(0xC9)) /*!< Length (number of  bytes) of the received packet: */

/**
 * @}
 */

